src/test/resources/examples/HeartBeatNotification.xml


<!--
  ~ Licensed under the EUPL, Version 1.2 or – as soon they will be approved by
  ~ the European Commission - subsequent versions of the EUPL (the "Licence");
  ~ You may not use this work except in compliance with the Licence.
  ~ You may obtain a copy of the Licence at:
  ~
  ~   https://joinup.ec.europa.eu/software/page/eupl
  ~
  ~ Unless required by applicable law or agreed to in writing, software
  ~ distributed under the Licence is distributed on an "AS IS" basis,
  ~ WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  ~ See the Licence for the specific language governing permissions and
  ~ limitations under the Licence.
  -->

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Body>
        <q1:HeartbeatNotification xmlns:q1="http://www.siri.org.uk/siri"><q1:RequestTimestamp>2016-06-06T08:31:43.1237473+02:00</q1:RequestTimestamp><q1:ProducerRef>VehicleMonitoring</q1:ProducerRef><q1:MessageIdentifier>HeartbeatNotification_636007987031237473</q1:MessageIdentifier><q1:ValidUntil>2016-06-06T09:31:43.1237473+02:00</q1:ValidUntil><q1:ShortestPossibleCycle>PT1M</q1:ShortestPossibleCycle></q1:HeartbeatNotification>
    </s:Body>
</s:Envelope>
